NAME
    blkfree - free memory allocated to named block

SYNOPSIS
    blkfree(val)

TYPES
    val		named block, string, or integer

    return	null value

DESCRIPTION
    If val is a named block, or the name of a named block, or the
    identifying index for a named block, blkfree(val) frees the
    memory block allocated to this named block.	 The block remains
    in existence with the same name, identifying index, and chunksize,
    but its size and maxsize becomes zero and the pointer for the start
    of its data block null.

    A new block of memory may be allocated to a freed block B by
    blk(B [, len, chunk]), len defaulting to zero and chunk to the
    chunksize when the block was freed.

EXAMPLE

    > B1 = blk("foo")
    > B2 = blk("Second block")
    show blocks
     id	  name
    ----  -----
     0	 foo
     1	 Second block

    > blkfree(B1)
    > show blocks
     id	  name
    ----  -----
     1	 Second block

    > B1
	block 0: foo
	chunksize = 256, maxsize = 0, datalen = 0
	NULL

    > blk(B1); B[7] = 5
    > B1
	block 0: foo
	chunksize = 256, maxsize = 256, datalen = 8
	0000000000000005

LIMITS
    none

LINK LIBRARY
    none

SEE ALSO
    blk, blocks

## Copyright (C) 1999  Landon Curt Noll
##
## Calc is open software; you can redistribute it and/or modify it under
## the terms of the version 2.1 of the GNU Lesser General Public License
## as published by the Free Software Foundation.
##
## Calc is distributed in the hope that it will be useful, but WITHOUT
## ANY WARRANTY; without even the implied warranty of MERCHANTABILITY
## or FITNESS FOR A PARTICULAR PURPOSE.	 See the GNU Lesser General
## Public License for more details.
##
## A copy of version 2.1 of the GNU Lesser General Public License is
## distributed with calc under the filename COPYING-LGPL.  You should have
## received a copy with calc; if not, write to Free Software Foundation, Inc.
## 59 Temple Place, Suite 330, Boston, MA  02111-1307, USA.
##
## @(#) $Revision: 29.2 $
## @(#) $Id: blkfree,v 29.2 2000/06/07 14:02:33 chongo Exp $
## @(#) $Source: /usr/local/src/cmd/calc/help/RCS/blkfree,v $
##
## Under source code control:	1997/04/05 13:07:13
## File existed as early as:	1997
##
## chongo <was here> /\oo/\	http://www.isthe.com/chongo/
## Share and enjoy!  :-)	http://www.isthe.com/chongo/tech/comp/calc/
