NAME
    digits - return number of "decimal" digits in an integral part

SYNOPSIS
    digits(x [,b])

TYPES
    x		real
    b		integer >= 2, defaults to 10

    return	integer

DESCRIPTION
    Returns number of digits in the standard base-b representation
    when x is truncated to an integer and the sign is ignored.

    To be more precise: when abs(int(x)) > 0, this function returns
    the value 1 + ilog(x, b).  When abs(int(x)) == 0, then this
    function returns the value 1.

    If omitted, b is assumed to be 10.  If given, b must be an
    integer > 1.

    One should remember these special cases:

	digits(12.3456) == 2    computes with the integer part only
	digits(-1234) == 4      computes with the absolute value only
	digits(0) == 1          specical case
	digits(-0.123) == 1     combination of all of the above

EXAMPLE
    > print digits(100), digits(23209), digits(2^72)
    3 5 22

    > print digits(0), digits(1), digits(-1)
    1 1 1

    > print digits(-1234), digits(12.3456), digits(107.207)
    4 2 3

    > print digits(17^463-1, 17), digits(10000, 100), digits(21701, 2)
    3, 15 14

LIMITS
    b > 1

LINK LIBRARY
    long qdigits(NUMBER *q, ZVALUE base)

SEE ALSO
    digit, places

## Copyright (C) 1999-2003  Landon Curt Noll
##
## Calc is open software; you can redistribute it and/or modify it under
## the terms of the version 2.1 of the GNU Lesser General Public License
## as published by the Free Software Foundation.
##
## Calc is distributed in the hope that it will be useful, but WITHOUT
## ANY WARRANTY; without even the implied warranty of MERCHANTABILITY
## or FITNESS FOR A PARTICULAR PURPOSE.	 See the GNU Lesser General
## Public License for more details.
##
## A copy of version 2.1 of the GNU Lesser General Public License is
## distributed with calc under the filename COPYING-LGPL.  You should have
## received a copy with calc; if not, write to Free Software Foundation, Inc.
## 59 Temple Place, Suite 330, Boston, MA  02111-1307, USA.
##
## @(#) $Revision: 29.5 $
## @(#) $Id: digits,v 29.5 2003/01/26 19:41:35 chongo Exp $
## @(#) $Source: /usr/local/src/cmd/calc/help/RCS/digits,v $
##
## Under source code control:	1995/10/03 10:40:01
## File existed as early as:	1995
##
## chongo <was here> /\oo/\	http://www.isthe.com/chongo/
## Share and enjoy!  :-)	http://www.isthe.com/chongo/tech/comp/calc/
