NAME
    . - oldvalue

SYNOPSIS
    .  (with no adjacent letters or digits or _ or .)

TYPES
    return	any

DESCRIPTION
    The "old value" is essentially a global variable with identifier "."
    which at top level when directly from a file or keyboard
    is automatically assigned the saved value for a line
    of statements when evaluation of that line is completed and this saved
    value is not null.	A line of statements is normally completed by a
    '\n' not within a block bounded by braces or an expression bounded by
    parentheses.

    Disabling of saving by calling saveval(0) causes lines to return a
    null value and . then becomes in effect a global variable whose
    value may be changed by assignments and operations like ++ and --.

    A null value may be assigned to . by . = null() or free(.).

EXAMPLE
    > saveval(1);
    > a = 2
    > .
	    2
    > . += 3; b = . + 4
    > print ., b
    9 9
    > . += 3; b = . + 4; null()
    > print ., b
    12 16
    > list(a, b, a + b)

    list (3 elements, 3 nonzero):
	    [[0]] = 2
	    [[1]] = 16
	    [[2]] = 18

    > saveval(0)
    > print pop(.), .[[1]]
    2 18

LIMITS
    none

LINK LIBRARY
    none

SEE ALSO
    saveval

## Copyright (C) 1999  Landon Curt Noll
##
## Calc is open software; you can redistribute it and/or modify it under
## the terms of the version 2.1 of the GNU Lesser General Public License
## as published by the Free Software Foundation.
##
## Calc is distributed in the hope that it will be useful, but WITHOUT
## ANY WARRANTY; without even the implied warranty of MERCHANTABILITY
## or FITNESS FOR A PARTICULAR PURPOSE.	 See the GNU Lesser General
## Public License for more details.
##
## A copy of version 2.1 of the GNU Lesser General Public License is
## distributed with calc under the filename COPYING-LGPL.  You should have
## received a copy with calc; if not, write to Free Software Foundation, Inc.
## 59 Temple Place, Suite 330, Boston, MA  02111-1307, USA.
##
## @(#) $Revision: 29.2 $
## @(#) $Id: oldvalue,v 29.2 2000/06/07 14:02:33 chongo Exp $
## @(#) $Source: /usr/local/src/cmd/calc/help/RCS/oldvalue,v $
##
## Under source code control:	1997/09/06 20:03:35
## File existed as early as:	1997
##
## chongo <was here> /\oo/\	http://www.isthe.com/chongo/
## Share and enjoy!  :-)	http://www.isthe.com/chongo/tech/comp/calc/
