NAME
    putenv - set the value of an environment variable

SYNOPSIS
    putenv(env [,val])

TYPES
    env		str
    val		str

    return	int

DESCRIPTION
     This function will set or change the value of an environment variable.
     Zero is returned if the environment variable was successfully set,
     otherwise a non-zero result is returned.

     When called with 1 arg, env must be a string of the form:

	    "envname=envval"

     This sets the environment variable "envname" to the value "envval".

     The 2 arg form is equivalent to:

	    putenv(strcat(env, "=", val))


EXAMPLE
    > putenv("name", "value")
	    0
    > getenv("name")
	    "value"
    > putenv("name=val2")
	    0
    > getenv("name")
	    "val2"
    > isnull(getenv("unknown"))
	    1

LIMITS
    With 1 arg, env must contain at least 1 '=' character.

LINK LIBRARY
    none

SEE ALSO
    getenv

## Copyright (C) 1999  Landon Curt Noll
##
## Calc is open software; you can redistribute it and/or modify it under
## the terms of the version 2.1 of the GNU Lesser General Public License
## as published by the Free Software Foundation.
##
## Calc is distributed in the hope that it will be useful, but WITHOUT
## ANY WARRANTY; without even the implied warranty of MERCHANTABILITY
## or FITNESS FOR A PARTICULAR PURPOSE.	 See the GNU Lesser General
## Public License for more details.
##
## A copy of version 2.1 of the GNU Lesser General Public License is
## distributed with calc under the filename COPYING-LGPL.  You should have
## received a copy with calc; if not, write to Free Software Foundation, Inc.
## 59 Temple Place, Suite 330, Boston, MA  02111-1307, USA.
##
## @(#) $Revision: 29.2 $
## @(#) $Id: putenv,v 29.2 2000/06/07 14:02:33 chongo Exp $
## @(#) $Source: /usr/local/src/cmd/calc/help/RCS/putenv,v $
##
## Under source code control:	1995/07/09 03:48:57
## File existed as early as:	1995
##
## chongo <was here> /\oo/\	http://www.isthe.com/chongo/
## Share and enjoy!  :-)	http://www.isthe.com/chongo/tech/comp/calc/
